In [1]:
import pandas as pd

In [2]:
data={
    "Name":["Abhay","Uday","Aditya"],
    "Age":[20,22,23],
    "City":["Etawah","Mathura","Hodal"]
}

In [19]:
df.to_csv("output.csv",index=False)

In [10]:
df=pd.DataFrame(data)
df.head()

     Name  Age     City
0   Abhay   20   Etawah
1    Uday   22  Mathura
2  Aditya   23    Hodal

How to save data After some Op..
# This for csv files only...
df.to_csv("output.csv",index=False)
# This for JSON ...
df.to_json("output.csv",index=False)
# This for Excel...
df.to_excel("output.csv",index=False)

In [27]:
df.to_csv("output.csv",index=False)
df.to_json("output.json",index=False)

In [29]:
pd.read_json("output.json")

     Name  Age     City
0   Abhay   20   Etawah
1    Uday   22  Mathura
2  Aditya   23    Hodal